public class Procedureandobject {
    //面向对象和面向过程的区别和联系
    public static void main(String[] args) {
//        面向过程（Procedure Oriented 简称 PO）：把事情拆分成几个步骤（相当于拆分成一个个的方法和数据），然后按照一定的顺序执行。
//
//        面向对象（Object Oriented 简称 OO）：面向对象会把事物抽象成对象的概念，先抽象出对象，然后给对象赋一些属性和方法，然后让每个对象去执行自己的方法。
//       面向过程的优点：效率高，因为不需要实例化对象。
        //面向过程的缺点：缺点：耦合度高，扩展性差，不易维护.
        //面向对象的优点：耦合低（易复用），扩展性强，易维护，由于面向对象有封装、继承、多态性的特点，可以设计出低耦合的系统，使系统更加灵活、更加易于维护。
        //面向对象的缺点：难于理解，效率比面向过程低。
    //用代码演示面向过程和面向对象的区别

    }
}
